tutorials/lagrangian/reactingParcelFoam/splashPanel/system/wallFilmRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/wallFilmRegion";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(Uf|hf|deltaf\*rhof)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    deltaf
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
}


PISO
{
    momentumPredictor yes;
    nCorr           1;
    nNonOrthCorr    0;
}


relaxationFactors
{
    fields
    {
        ".*"            1;
    }
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //
